# Yosys synthesis script for ${TOP_MODULE}
# Read verilog files
read_verilog -sv  /home/rsunketa/OpenFPGA/openfpga-test-runs/noc-benchmarks/Synthetic_Designs/simple_8_noc_1D_chain/verilog/*v
read_verilog -sv  /home/rsunketa/OpenFPGA/openfpga-test-runs/noc-benchmarks/Synthetic_Designs/shared_verilog/*v

#read_verilog -sv /home/rsunketa/OpenFPGA/openfpga-test-runs/noc-benchmarks/Large_Designs/MLP/MLP_2/verilog/mlp_2.v
#read_verilog -sv /home/rsunketa/OpenFPGA/openfpga-test-runs/noc-benchmarks/Large_Designs/MLP/shared_verilog/*v

read_verilog -lib -specify /home/rsunketa/OpenFPGA/openfpga_flow/openfpga_yosys_techlib/k6_frac_N10_tileable_adder_chain_dpram8K_dsp36_fracff_40nm_cell_sim.v

# Technology mapping
hierarchy -top simple_eight_noc_1D_chain
flatten
proc
techmap -D NO_LUT -map /home/rsunketa/OpenFPGA/openfpga_flow/openfpga_yosys_techlib/k6_frac_N10_tileable_adder_chain_dpram8K_dsp36_fracff_40nm_dff_map.v

check
opt_expr -mux_undef -mux_bool -undriven -noclkinv -fine -full -keepdc
opt_merge -share_all
opt_dff -nodffe -nosdff -keepdc -sat

#memory -nomap

#opt_expr -mux_undef -mux_bool -undriven -noclkinv -fine -full -keepdc
#opt_merge -share_all
#opt_dff -nodffe -nosdff -keepdc -sat

memory_map

opt_expr -mux_undef -mux_bool -undriven -noclkinv -fine -full -keepdc
opt_merge -share_all
opt_dff -nodffe -nosdff -keepdc -sat

techmap

opt_expr -mux_undef -mux_bool -undriven -noclkinv -fine -full -keepdc
opt_merge -share_all
opt_dff -nodffe -nosdff -keepdc -sat


# LUT mapping
abc -lut 6

# FF mapping

techmap -D NO_LUT -map /home/rsunketa/OpenFPGA/openfpga_flow/openfpga_yosys_techlib/k6_frac_N10_tileable_adder_chain_dpram8K_dsp36_fracff_40nm_dff_map.v


# Check
synth -run check

# Clean and output blif
#opt_clean -purge
write_blif simple_8_noc_1D_chain.blif
