# Yosys synthesis script for ${TOP_MODULE}

# Read verilog files
read_verilog  ${VERILOG_FILES}
# Read technology library
read_verilog -sv -lib -specify ${YOSYS_CELL_SIM_VERILOG}
read_verilog -sv  /mnt/vault1/mfaroo19/OpenFPGA/openfpga-test-runs/002-FPL-tasks/01-Push-button-flow/benchmarks/synthetic-mlp/shared_verilog/*v


read_verilog -lib -specify /mnt/vault1/rsunketa/OpenFPGA/openfpga_flow/openfpga_yosys_techlib/k6_frac_N10_tileable_adder_chain_dpram8K_dsp36_fracff_40nm_cell_sim.v


# Technology mapping
hierarchy -top ${TOP_MODULE}
proc
techmap -D NO_LUT -map /mnt/vault1/rsunketa/OpenFPGA/openfpga_flow/openfpga_yosys_techlib/k6_frac_N10_tileable_adder_chain_dpram8K_dsp36_fracff_40nm_dff_map.v

# techmap -D NO_LUT -map +/adff2dff.v

# Synthesis
flatten
opt_expr
opt_clean
check
opt -nodffe -nosdff
fsm
opt -nodffe -nosdff
wreduce
peepopt
opt_clean
opt -nodffe -nosdff
memory -nomap
opt_clean
opt -fast -full -nodffe -nosdff
memory_map
opt -full -nodffe -nosdff
techmap
opt -fast -nodffe -nosdff
clean

# LUT mapping
abc -lut ${LUT_SIZE}
techmap -D NO_LUT -map /mnt/vault1/rsunketa/OpenFPGA/openfpga_flow/openfpga_yosys_techlib/k6_frac_N10_tileable_adder_chain_dpram8K_dsp36_fracff_40nm_dff_map.v

# Check
synth -run check

# Clean and output blif
opt_clean -purge
write_blif ${OUTPUT_BLIF}
