# Yosys synthesis script for router_bench
# Read verilog files
read_verilog  ./benchmark/router_bench.v
read_verilog -lib -specify  /opt/openfpga/test-runs/dummy-router/verilog-files/dummy_router3.v
#read_verilog -lib -specify /home/rsunketa/OpenFPGA/test_runs/nocgen/src/*v

# Technology mapping
hierarchy -top router_bench
proc


#techmap -map /home/rsunketa/OpenFPGA/yosys/share/router2router_slice.v -max_iter 3
techmap -D NO_LUT -map +/adff2dff.v

# Synthesis
flatten -wb
opt_expr
opt_clean
check
opt -nodffe -nosdff
fsm
opt -nodffe -nosdff
wreduce
peepopt
opt_clean
opt -nodffe -nosdff
memory -nomap
opt_clean
opt -fast -full -nodffe -nosdff
memory_map
opt -full -nodffe -nosdff
techmap
opt -fast -nodffe -nosdff
clean

clean

# LUT mapping
abc -lut 6

# Check
synth -run check

# Clean and output blif
opt_clean -purge

write_verilog router_bench_output_verilog.v
write_blif rewritten_router_bench_yosys_out.blif
