read_verilog -sv  /home/rsunketa/OpenFPGA/openfpga-test-runs/noc-benchmarks/Synthetic_Designs/complex_4_noc_1D_chain/verilog/*v
read_verilog -sv  /home/rsunketa/OpenFPGA/openfpga-test-runs/noc-benchmarks/Synthetic_Designs/shared_verilog/*v

read_verilog -lib -specify /home/rsunketa/OpenFPGA/openfpga_flow/openfpga_yosys_techlib/k6_frac_N10_tileable_adder_chain_dpram8K_dsp36_fracff_40nm_cell_sim.v

hierarchy -top  complex_4_noc_1D_chain

flatten
proc

opt_expr -mux_undef -mux_bool -undriven -noclkinv -fine -full -keepdc
opt_merge -share_all
opt_dff -nodffe -nosdff -keepdc -sat

#memory 

techmap
techmap -map +/gate2lut.v   

techmap -D NO_LUT -map /home/rsunketa/OpenFPGA/openfpga_flow/openfpga_yosys_techlib/k6_frac_N10_tileable_adder_chain_dpram8K_dsp36_fracff_40nm_dff_map.v


opt_expr -mux_undef -mux_bool -undriven -noclkinv -fine -full -keepdc
opt_merge -share_all
opt_dff -nodffe -nosdff -keepdc -sat

abc -fast -lut 6

opt_expr -mux_undef -mux_bool -undriven -noclkinv -fine -full -keepdc
opt_merge -share_all
opt_dff -nodffe -nosdff -keepdc -sat

synth -run check

# write_blif complex_4_noc_1D_chain.blif