# Yosys synthesis script for noc

# Read verilog files
read_verilog  ./benchmark/noc_bench.v
# Read technology library
read_verilog -lib -specify /mnt/vault1/rsunketa/OpenFPGA/openfpga-test-runs/dummy-router/verilog-files/dummy_router.v

# Technology mapping
hierarchy -top noc
proc
techmap -map /mnt/vault1/rsunketa/OpenFPGA/openfpga-test-runs/dummy-router/verilog-files/router2router_slice1.v -max_iter 5
techmap -D NO_LUT -map +/adff2dff.v

# Synthesis
flatten
opt_expr
opt_clean
check
opt -nodffe -nosdff
fsm
opt -nodffe -nosdff
wreduce
peepopt
opt_clean
opt -nodffe -nosdff
memory -nomap
opt_clean
opt -fast -full -nodffe -nosdff
memory_map
opt -full -nodffe -nosdff
techmap
opt -fast -nodffe -nosdff
clean

# LUT mapping
abc -lut 6

# Check
synth -run check

# Clean and output blif
opt_clean -purge
write_blif noc_yosys_out.blif
